/*
Задача: построить консольное приложение для управления личными финансами.
Сущности бизнес-домена:
Пользователь, Счет, Операция, Категория Доходов, Категория Расходов.
У каждого пользователя может быть несколько счетов, и он может проводить операции по
одному из них.
Операция может иметь в себя категорию доходов, если операция приносит прибыль, либо
категорию расходов в противном случае.
Операции с нулевым оборотом недопустимы.
Операции без категории или с невалидной для типа операции (доход/расход) категорией
недопустимы.
Приложение должно хранить информацию о всех вышеописанных сущностях в БД, а также
хранить лог действий пользователя в локальном файле.
Необходимо реализовать два режима работы приложения:
1) Добавление новой операции существующим пользователем
2) Экспорт выписки по счету в csv формате (должен создавать выходной файл .csv).
Выписка должна включать список операций за определенный период.
Первый режим реализовать при помощи JPA/Hibernate, второй - при помощи JDBC
В обоих случаях, пользователь должен передать в приложение, посредством аргументов
командной строки или переменных среды: идентификатор пользователя (его id, email,
или phone number, на выбор разработчика), а также имя пользователя и пароль для
подключения к БД.
Для дат в БД использовать тип timestamp, в java - Instant. Текстовый формат дат -
ISO_LOCAL_DATE_TIME из java.time.
Данные для тестирования ввести в БД можно вручную (пользователи, счета и категории
операций)
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Main.main");
    }
}
